#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-vXDtJ7NzyRaBMq3Q

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.agencies_lambda.data.archive_file.agencies_source: Refreshing...
module.agencies_lambda.data.archive_file.agencies_source: Refresh complete after 0s [id=08b63c2b46858cbfcfe5e3bf2f3bd99e5433174e]
module.agencies_lambda.aws_s3_object.agencies_s3_bucket: Refreshing state... [id=agencies_lambda.zip]
module.iam_maxfrise_lambdas.aws_iam_role.iam_maxfrise_lambdas: Refreshing state... [id=iam_maxfrise_lambdas]
module.maxfrise_api_gateway.aws_api_gateway_rest_api.maxfrise_api: Refreshing state... [id=8hbmj9nmrj]
module.dynamoDB_agencies_prod_table.aws_dynamodb_table.agencies_prod: Refreshing state... [id=agencies-prod-table]
module.dynamoDB_agencies_test_table.aws_dynamodb_table.agencies_test: Refreshing state... [id=agencies-test-table]
module.maxfrise_api_gateway.aws_api_gateway_resource.agencies_resource: Refreshing state... [id=udh18b]
module.agencies_lambda.aws_lambda_function.agencies_lambda: Refreshing state... [id=agencies_lambda]
module.maxfrise_api_gateway.aws_api_gateway_method.agencies_resource_method: Refreshing state... [id=agm-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_gateway.aws_lambda_permission.agencies_api_lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration_request: Refreshing state... [id=agi-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_prod_deployment: Refreshing state... [id=1zzhz3]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_test_deployment: Refreshing state... [id=71rqag]
module.maxfrise_api_gateway.aws_api_gateway_stage.prod: Refreshing state... [id=ags-8hbmj9nmrj-prod]
module.maxfrise_api_gateway.aws_api_gateway_stage.test: Refreshing state... [id=ags-8hbmj9nmrj-test]
module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration_request: Drift detected (update)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration_request has changed
  ~ resource "aws_api_gateway_integration" "agencies_lambda_integration_request" {
      + cache_key_parameters    = []
        id                      = "agi-8hbmj9nmrj-udh18b-POST"
      + request_parameters      = {}
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.agencies_lambda.aws_lambda_function.agencies_lambda will be updated in-place
  ~ resource "aws_lambda_function" "agencies_lambda" {
        id                             = "agencies_lambda"
      ~ last_modified                  = "2023-06-28T04:59:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "M1fzRGA079Gl9TpbJbrSZ32oq3RALtpx4dBDyasl5b4=" -> "EMqTQZxmU+oMNA9EH0stb+CqFU+5zg0jDTnyEFtkogw="
        tags                           = {}
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.agencies_lambda.aws_s3_object.agencies_s3_bucket will be updated in-place
  ~ resource "aws_s3_object" "agencies_s3_bucket" {
      ~ etag                   = "41ebe9ad1c0bca5a0000d1db5d242b01" -> "62509d2c26033f572d478d4283b877da"
        id                     = "agencies_lambda.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_deployment.api_prod_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "api_prod_deployment" {
      ~ created_date  = "2023-06-28T05:59:19Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-west-2:914036813947:8hbmj9nmrj/" -> (known after apply)
      ~ id            = "1zzhz3" -> (known after apply)
      ~ invoke_url    = "https://8hbmj9nmrj.execute-api.us-west-2.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "7ae2c07362fa338baef6cc1e0acd235940227f1c" -> "74cc6b4e0359817a67eccf125045b4d2fe27c21f"
        }
        # (1 unchanged attribute hidden)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_deployment.api_test_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "api_test_deployment" {
      ~ created_date  = "2023-06-28T05:59:17Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-west-2:914036813947:8hbmj9nmrj/" -> (known after apply)
      ~ id            = "71rqag" -> (known after apply)
      ~ invoke_url    = "https://8hbmj9nmrj.execute-api.us-west-2.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "7ae2c07362fa338baef6cc1e0acd235940227f1c" -> "74cc6b4e0359817a67eccf125045b4d2fe27c21f"
        }
        # (1 unchanged attribute hidden)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_stage.prod will be updated in-place
  ~ resource "aws_api_gateway_stage" "prod" {
      ~ deployment_id         = "1zzhz3" -> (known after apply)
        id                    = "ags-8hbmj9nmrj-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_stage.test will be updated in-place
  ~ resource "aws_api_gateway_stage" "test" {
      ~ deployment_id         = "71rqag" -> (known after apply)
        id                    = "ags-8hbmj9nmrj-test"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.

```

</details>

*Pushed by: @inavac182, Action: `pull_request`*